// src/chartData.ts

export const chartOptions = [
    {
      title: '各站等侯人數',
      data: {
        xAxis: ['一般檢查', '聽力檢查', '視力檢查', '眼壓檢查', '理學檢查', 'X光檢查', '唾液檢查', '糞便檢查', '血液檢查', '尿液檢查', '心電圖', '乳房攝影', '超音波', '內視鏡', '抹片', '磁振造影', '醫師會診', '電腦斷層', '正子'],
        series: [
            {
              data: [13, 16, 6, 8, 6, 17, 3, 4, 7, 31, 11, 5, 2, 4, 2, 6, 3, 6, 5, 2],
              color: '#1398CC',
            },
          ],
      },
    },
    {
      title: '各站最長等侯时間(分鐘)',
      data: {
        xAxis: ['一般檢查', '聽力檢查', '視力檢查', '眼壓檢查', '理學檢查', 'X光檢查', '唾液檢查', '糞便檢查', '血液檢查', '尿液檢查', '心電圖', '乳房攝影', '超音波', '內視鏡', '抹片', '磁振造影', '醫師會診', '電腦斷層', '正子'],
        series: [
          {
            data: [3, 4, 1, 2, 2, 5, 7,2,1,15,5,3,5,4,3,6,3,6,5,7],
            color: '#19D7B4',
          },
        ],
      },
    },
    {
        title: '各站平均等侯时間(分鐘)',
        data: {
            xAxis: ['一般檢查', '聽力檢查', '視力檢查', '眼壓檢查', '理學檢查', 'X光檢查', '唾液檢查', '糞便檢查', '血液檢查', '尿液檢查', '心電圖', '乳房攝影', '超音波', '內視鏡', '抹片', '磁振造影', '醫師會診', '電腦斷層', '正子'],
          series: [
            {
              data: [2,3,1,2,2,3,4,2,1,4,3,3,3,4,2,4,2,4,3,4],
              color: '#D9C40B',
            },
          ],
        },
      },
      {
        title: '每時段報到人數',
        data: {
          xAxis: ['9:00~9:59', '10:00~10:59', '11:00~11:59', '13:00~13:59', '14:00~14:59', '15:00~15:59'],
          series: [
            {
              data: [14,38,35,20,11],
              color: '#EB9A20'
            },
          ],
        },
      },
  ];
  